function findCurrentPage() {
    let tmpImage = image.captureFullScreen();
    // let  e = image.saveTo(tmpImage,"/sdcard/ec/yy.png");
    // let  r = image.pixel(tmpImage,100,100);
    // let uu = image.clip(tmpImage, 468,216,530,408);
    // let  f = image.saveTo(uu,"/sdcard/ec/yy1.png");

    logi(tmpImage);
    if (tmpImage != null) {
        // image.setFindColorImageMode(1)
        let multiColor = [
            "426|96|#4E86FF-#101010,422|132|#FFFFFF-#101010,758|120|#75A3FD-#101010,694|182|#679BFF-#101010,1808|114|#88CDFF-#101010,1924|124|#86C9FF-#101010,1886|130|#FFFFFF-#101010",
            "478|238|#FB8A37-#101010,524|294|#FB9041-#101010,482|394|#FA9A50-#101010",
            "1070|880|#EEDBB6-#101010,1284|876|#E2C39B-#101010,1388|680|#C4EACF-#101010,1156|114|#F0E4A3-#101010,2050|164|#FFFFFF-#101010",
            "2188|57|#FFFFFF-#101010,2175|57|#FFFFFF-#101010,2160|45|#FFFFFF-#101010,2162|71|#FFFFFF-#101010,2162|59|#FFFFFF-#101010,2157|56|#FFFFFF-#101010,2124|74|#BABDB8-#101010,2106|73|#F5F7F3-#101010,2090|71|#FFFFFF-#101010,2093|57|#FFFFFF-#101010,2093|44|#FFFFFF-#101010,2073|46|#FFFFFF-#101010,2072|69|#FFFFFF-#101010,2063|67|#FFFFFF-#101010,2067|45|#FFFFFF-#101010,2046|52|#FFFFFF-#101010,2041|72|#FFFFFF-#101010",
            "350|145|#61B68F-#101010,385|960|#60AF8B-#101010,560|620|#95D093-#101010,935|745|#FCE19F-#101010,1385|765|#FBDC96-#101010,1675|305|#C3CE94-#101010,1715|50|#81BEA3-#101010",
            "145|105|#E4EEF6-#101010,210|695|#B09F80-#101010,685|395|#ACCEF3-#101010,1720|120|#FEFDFE-#101010,1060|1010|#D08927-#101010,1770|995|#D4C2A2-#101010,2235|70|#FEEBDE-#101010,2190|1040|#FEFEDB-#101010",
            "275|180|#818A94-#101010,215|545|#4E4F4B-#101010,230|965|#705124-#101010,1760|185|#888C8E-#101010,1770|660|#524F47-#101010,1750|970|#76562E-#101010,1560|975|#FEDD94-#101010,985|965|#D6E3FE-#101010",
            "815|125|#3A4B42-#101010,785|850|#CDDDFF-#101010,970|825|#DAE6FF-#101010,1370|825|#FFE39F-#101010,1545|835|#FEDF97-#101010,205|970|#2E403F-#101010,1760|1020|#2D4340-#101010,560|305|#D48963-#101010",
            "175|355|#271A22-#101010,140|950|#EFCEF0-#101010,585|990|#F0B6A5-#101010,1690|1010|#F3BEAC-#101010,1775|830|#EDD1F1-#101010,2270|950|#EFCDF0-#101010,2270|210|#30232C-#101010,1795|145|#472621-#101010",
            "310|450|#160C0A-#101010,975|965|#D6E3FF-#101010,1570|975|#FCDC95-#101010,2105|410|#0E060A-#101010,2140|955|#8D778D-#101010,1805|1010|#8E6E64-#101010,610|1015|#906F65-#101010,195|970|#8D768D-#101010,1920|220|#483324-#101010",
            "606|206|#6A5435-#101010,348|408|#3C3729-#101010,288|720|#3C392A-#101010,340|952|#7D775C-#101010,966|974|#D3E1FF-#101010,1546|982|#FDD98F-#101010,1614|200|#756347-#101010,2054|950|#7D755C-#101010",
            "36|57|#5C565D-#101010,76|123|#3B342C-#101010,25|300|#D7B688-#101010,51|585|#896244-#101010,42|1054|#84713C-#101010",
            "385|180|#229B94-#101010,788|456|#229B94-#101010,1190|173|#229B94-#101010,1795|696|#50AE82-#101010,1416|626|#E7E1DA-#101010,316|700|#4A342E-#101010,713|753|#FFDB8E-#101010,1955|165|#C2B5AF-#101010",
            "1847|252|#E38E6B-#101010,1818|221|#EC9C7B-#101010,1857|182|#EFA282-#101010,1890|211|#E89675-#101010,1848|181|#D2714B-#101010,1868|278|#F0A084-#101010,1902|345|#DB7F59-#101010,1954|342|#DE8663-#101010,1922|342|#070606-#101010,1860|334|#6C6D71-#101010,1917|208|#A5F1BB-#101010,1860|215|#FFF6E2-#101010",
            "1857|166|#EFF0F7-#101010,1871|178|#F1F3F8-#101010,1882|167|#E2E2E6-#101010,1871|152|#DDDFE3-#101010,1866|163|#7790C6-#101010,1865|173|#7A90C8-#101010,1877|174|#7790C6-#101010,1875|164|#839ACB-#101010,1871|167|#7891C6-#101010,1900|187|#6081C2-#101010",
            "382|175|#229B94-#101010,790|455|#229B94-#101010,972|280|#D8D0C9-#101010,637|160|#E3DBD5-#101010,707|420|#FBCE9F-#101010,1107|672|#D5D39D-#101010,1460|427|#DBD3AA-#101010,1842|925|#CDCEBE-#101010",

        ];
        let points = image.cmpMultiColor(tmpImage, multiColor, 0.9, 0, 0, 0, 0);
        logd("points " + points);
        stayGo();
        switch (points) {
            // 小广播
            case 0:
                logi('小广播')
                clickPoint(random(1868, 1902), random(110, 146));
                GO();
                break;
            case 1:
                logi('上新专场')
                clickPoint(random(2040, 2060), random(150, 170))
                GO();
                break;
            case 2:
                logi('美自天成页面');
                GO();
                clickPoint(random(2040, 2060), random(150, 170))
                break;
            case 3:
                logi('跳过页面')
                click_answer_tiaoguo();
                sleep(500);
                handlerTiaoguo();
                GO();
                break;
            case 4:
                logi('进游戏页面');
                click_center_ok();
                GO();
                break;
            case 5:
                logi('小麦游戏');
                gameStartGeXiaoMai();
                GO();
                break;
            case 6:
                logi('小麦游戏结束');
                click_game_wanchentiaozhan();
                sleep(2000);
                click_niangzao_wrapper();
                GO();
                break;
            case 7:
                logi('再次挑战');
                click_game_ReStart();
                GO();
                break;
            case 8:
                logi('拌曲游戏');
                gameStartBanQu();
                GO();
                break;
            case 9:
                logi('拌曲游戏结束');
                click_game_wanchentiaozhan();
                // sleep(2000);
                // click_niangzao_wrapper();
                GO();
                break;
            case 10:
                logi('脚丫游戏结束');
                click_game_wanchentiaozhan();
                // sleep(2000);
                GO();
                break;
            case 11:
                logi('脚丫游戏开始');
                gameStartCaiJiaoYing();
                GO();
                break;
            case 12:
                logi('领基酒页面');
                click_yi_jian_ling_qu();
                sleep(1000);
                click_return_top()
                // GO();
                break;
            case 13:
                logi('签到页面');
                click_qiandao_x();
                GO();
                break;
            case 14:
                logi('活动指引');
                click_huodongzhiyin_x();
                GO();
                break;
            case 15:
                logi('领完基酒了。');
                jobMap.game.selected = true;
                GO();
                break;
            default:
                logi('不知道的页面')
                jiaYuan();
                startGame();
                sleep(1000);
                click_niangzao_wrapper();
                GO();
        }
        //图片要回收
        image.recycle(tmpImage)
    }

}